package com.example.testbase.Horizontalview;


import com.example.testbase.kuangjia.R;

import android.os.Bundle;
import android.app.Activity;
import android.content.Context;
import android.view.View;
import android.widget.RadioButton;
import android.widget.RadioGroup;

public class HorizontalviewActivity extends Activity {
    private RadioGroup menu_bar = null;
  /*  private String[] menu_title = {"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽",
    		"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"," 商会会歌", "入会须知"
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		,"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽", " 商会会歌", "入会须知"	
    		
    };
    */
    
      private String[] menu_title = {"商会简介", "商会成员", "商会章程", " 组织机构架构图", " 商会会徽"
   
    
};

    public Context context = this;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.gongyong);
		 menu_bar = (RadioGroup) findViewById(R.id.menu_bar);
	      
	        
	        for (int i = 0; i < menu_title.length; i++) {
	            String title = menu_title[i];
	            RadioButton radioButton = (RadioButton) View.inflate(context, R.layout.menu_btn, null);
	            radioButton.setText(title);
	           
	            menu_bar.addView(radioButton);
	        }
	       
	}



}
